controllers/BookController.php

    public function actionMyBooks()
    {
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }

        $books = UserBook::find()
            ->where(['user_id' => Yii::$app->user->id])
            ->orderBy(['created_at' => SORT_DESC])
            ->all();
---
SELECT * FROM `user_book` WHERE `user_id`=4 ORDER BY `created_at` DESC