controllers/ExchangeController.php

    public function actionMyRequests()
    {
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }
        $requests = ExchangeRequest::find()
            ->where(['from_user_id' => Yii::$app->user->id])
            ->with('toUser')
            ->orderBy(['created_at' => SORT_DESC])
            ->all();
---
SELECT * FROM `exchange_request` WHERE `from_user_id`=3 ORDER BY `created_at` DESC
SELECT * FROM `user` WHERE `id` IN (3, 1)

    public function actionIncoming()
    {
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }
        $requests = ExchangeRequest::find()
            ->where(['to_user_id' => Yii::$app->user->id, 'status' => 'pending'])
            ->with('fromUser')
            ->orderBy(['created_at' => SORT_DESC])
            ->all();
---
SELECT * FROM `exchange_request` WHERE (`to_user_id`=4) AND (`status`='pending') ORDER BY `created_at` DESC