controllers/SiteController.php

INSERT INTO `user` (`username`, `password_hash`) VALUES ('232', '$2y$13$oUKMrWY7dguOIhsJwXNaI.vJMO7YYNEbmu7fIOMO0RhxrxsJV1.zO')
---
    public function actionSignup()
    {
        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }
        $user = new User();
        if (Yii::$app->request->post()) {
            $user->username = Yii::$app->request->post('username');
            $user->password = Yii::$app->request->post('password');

            if ($user->save()) {

SELECT * FROM `user` WHERE NOT (`id`=4)
---
    public function actionUsers()
    {
        $users = User::find()->where(['not', ['id' => Yii::$app->user->id]])->all();