models/UserBook.php

    public static function getAvailableBooks()
    {
        return self::find()
            ->where(['status' => 'available'])
            ->with('user')
            ->orderBy(['created_at' => SORT_DESC])
            ->all();
---
SELECT * FROM `user_book` WHERE `status`='available' ORDER BY `created_at` DESC