models/User.php

SELECT * FROM `user` WHERE `id`=3
---
    public static function findByUsername($username) { return static::findOne(['username' => $username]); }